[
  {
    "img": "https://i.ibb.co/GH67k9H/legend-suspension-aero-air-suspension-for-harley-750x750.jpg",
    "name": "Legend Suspension AIR Suspension For Harley",
    "price": 1319,
    "minimumQuantity": 434,
    "maximumQuantity": 1000,
    "descriptions": "Legend Air Shocks allow the rider to experience all the benefits of a traditional air suspension, with the added kicker of a model-specific, bolt-in on-board compressor. What does this mean for a rider? The ability to adjust ride height on-the-fly by way of the included handlebar-mounted compressor switch. Adjustable air suspension has never been so accessible - custom suspenders at bolt-in prices, with bolt-in installation. Legend's packed a lot of value into this kit!"
  },
  {
    "img": "https://i.ibb.co/n6R81CG/continental-conti-attack-sm-supermoto-evo-tires-750x750.jpg",
    "name": "Talon Excel Takasago Complete Rear Wheel Honda",
    "price": 1719,
    "minimumQuantity": 544,
    "maximumQuantity": 1050,
    "descriptions": "The Conti Attack Super Moto EVO Tires are an advanced high performance street legal supermoto tire with an updated rubber compound for improved grip and extended mileage. The Traction Skin provides an extremely safe and short tire break-in for the ContiAttack. This is possible due to the revolutionary raw tread surface, which is the result of a new mold coating technology which eliminates the need for tire-release agents."
  },
  {
    "img": "https://i.ibb.co/82rRBYm/talon-excel-takasago-complete-rear-wheel-honda125cc450cc20022015-red-black-750x750.jpg",
    "name": "Moose Racing MX1 Front Hub",
    "price": 185,
    "minimumQuantity": 500,
    "maximumQuantity": 4650,
    "descriptions": "The combination of Talon Billet hubs with Excel Signature Series Takasago rims has set the benchmark for quality and durability. Tested by today's top riders in everything from Motocross, Supercross and Supermoto racing, this wheel package has proven time and again to be one of the best in the business.    All Talon hubs are made in England to the highest quality standards with a 36 hole construction offering superior hub strength over most brands 32 holes. The hubs are then laced to Excel Takasago Signature Series rims using ultra-strong stainless steel spokes with spline drive nipples to prevent stripping."
  },
  {
    "img": "https://i.ibb.co/TY5V0cx/ss475-cam-chest-kit-for-harley-oil-cooled-milwaukee-eight20172021-750x750.jpg",
    "name": "S&S 475 Cam Chest Kit For Harley",
    "price": 1255,
    "minimumQuantity": 434,
    "maximumQuantity": 10000,
    "descriptions": "Big horsepower numbers are the status symbol of a performance engine, but more often than not, the bolstered torque spec is what you really feel when riding it. This is particularly relevant for the heavy touring machines as it’s torque that rockets you onto the highway and it’s definitely torque that lets you effortlessly push a loaded bagger around slower traffic. Produce stump pulling torque down low in the RPM range as well as maintain respectable horsepower numbers."
  },
  {
    "id": "124e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Aaron",
    "ratings": "⭐⭐⭐⭐",
    "img": "https://media.istockphoto.com/photos/businessman-working-from-home-office-picture-id1320686310?k=20&m=1320686310&s=612x612&w=0&h=mFf4KR8rRcu_YXo4hHXx2TU-p40eoVP_9FpSxgrQHA0=",
    "review": "I'll update my rating depending on how Skytech handles my issue. 3 days after receiving this pc new, a loud popping sound came from what seemed like the psu, shutting everything down, and tripping my breaker. I know manufacturing defects happen, so I'm not knocking the overall product as it did run flawlessly until this incident, but will wait and see how skytech handles it."
  },
  {
    "id": "224e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Abbott",
    "ratings": "⭐⭐⭐⭐",
    "img": "https://media.istockphoto.com/photos/young-man-with-laptop-and-coffee-working-indoors-home-office-concept-picture-id1334702614?k=20&m=1334702614&s=612x612&w=0&h=PQSWANXjuHgHpVF-wIqVDoX1eRqjGHXzXfVm9t2sv6A=",
    "review": "The pc runs quiet, came wayyy sooner than I expected. Recommend buying an extra SSD because space runs out quickly, but overall a great pc. Came with an RTX 3060ti and Ryzen 7 3700X 8 core processor"
  },
  {
    "id": "324e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Abel",
    "ratings": "⭐⭐⭐⭐⭐",
    "img": "https://media.istockphoto.com/photos/shot-of-a-young-man-using-his-smartphone-to-send-text-messages-picture-id1358205700?k=20&m=1358205700&s=612x612&w=0&h=LV4PUQlQ3ptXsiB4-AO3tteEqVoSj1MZ9_Ogh__RMp0=",
    "review": "So the pc exceeding my expectations. My expectations were on the low side since we have shortages on cards and scalping cpus and it's just a mess out there for PC builders. I took a chance on a prebuilt since I have been terribly disappointed in pre-builts in the past but promised my son a gaming rig and I was fresh out of options.this PC came with everything promised. All very usable. I would have liked to have a full ATX MB, but its not a game changer. I would have liked to pick the exact 3050 ti but the TI I received was middle of the road but had all the ports needed, it was dual fan and rgb. 4 ram slots, even nice keyboard and mouse. I felt disappointed I could not build it myself like I have always done, but considering the state of PC building today. These guys delivered a good product for the price. So far they get a big thumbs up from me."
  },
  {
    "id": "424e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Abner",
    "ratings": "⭐⭐⭐⭐⭐",
    "img": "https://media.istockphoto.com/photos/young-man-is-playing-with-a-dog-and-do-selfie-picture-id1300658241?k=20&m=1300658241&s=612x612&w=0&h=wOsIy3BqboesWLm9BkUdpyTRnQS6zSzNeh9zQakxbxk=",
    "review": "Homie linked me and i bought it. Was a lil scared after seeing the reviews but got it two days ago on the 31st and its running great! would recommend."
  },
  {
    "id": "524e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Abraham",
    "ratings": "⭐",
    "img": "https://media.istockphoto.com/photos/smiling-mixed-race-mature-man-on-grey-background-picture-id1319763895?k=20&m=1319763895&s=612x612&w=0&h=kdi1vWYAjSj4jOL5UPFPERsfid2gPkwZN8TCYWycmnA=",
    "review": "The PC would not boot to Windows. Called Tech Support and was on live chat for 2 hours. They had me remove graphics card and Hard drive and still did not work. No phone support only by appointment because of Covid. Could of least provided some type of video chat so they could walk me through it. Said they could ship me a new hard drive in a week. Ended up returning PC. I did not spend 1500 to replace parts for this company. FYI if more that three parts are replaced this voids the warranty. Probably a bad motherboard or something. I would order a NZXT build similar price and better build quality. When you buy an overpriced pre-built you expect to work otherwise I would just build my own if I have to go with all this hassle."
  },
  {
    "id": "624e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Adam",
    "ratings": "⭐⭐⭐⭐⭐",
    "img": "https://media.istockphoto.com/photos/portrait-of-happy-mature-man-wearing-spectacles-and-looking-at-camera-picture-id1331257339?k=20&m=1331257339&s=612x612&w=0&h=cEaz1BNERrqTrIvuznB_YFgi24RH6afwb0bs2d2-LOo=",
    "review": "Anyone who has been searching for new PC's can agree thr price of GPU's are alittle crazy right now. The computer came securely packaged so no issues physically. Ran hard drive scans with no integrity issues. 3060ti is nice for gaming. The games I've tested so far (warzone, Overwatch, Battlefield V , sea of thieves, minecraft, Oculus vr- Beatsaber, VR chat ) the GPU is random from what I read. I was worried it would be a founders series but its not .this one is a MSI gpu which isn't bad. Nvidia software already on here . This overall pc is about 30 pounds and RGB (lights on pc) ready. Bunch of display ports , 1 hdmi .Comes with 1 year warranty unless you buy extended for two years. For thre price I know I got my moneys worth. No regrets with this investment"
  },
  {
    "id": "724e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Addison",
    "ratings": "⭐⭐⭐⭐",
    "img": "https://media.istockphoto.com/photos/cheerful-fashionable-adult-man-in-city-setting-picture-id1310533180?k=20&m=1310533180&s=612x612&w=0&h=m1GldagXwCGrKMO1ZdYNeJNlvFY-VW3T5Z2nr99E85M=",
    "review": "Computer has a Ryzen 3700x cpu and a 3060Ti GPU and does great. The only game i have played is Call of Duty which it handles that on the highest setting with no problems. For multitasking i wish i would have went with the 32MB RAM but surfing the internet is not slow. Overall a very good computer."
  },
  {
    "id": "824e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Adler",
    "ratings": "⭐⭐⭐",
    "img": "https://media.istockphoto.com/photos/mid-adult-man-is-listening-to-music-in-park-picture-id1319189368?k=20&m=1319189368&s=612x612&w=0&h=tzPu6IgqDECUL_ID2f9_3RjcYT4MsK1-pk-DVwhka70=",
    "review": "This pc runs very strong when it's doing what its suppose to I upgraded from a 1060 gtx and am blown away by the performance jump.. however with in the 1st hour after opening the box and firing this machine up one of my ram sticks almost immediately failed and stopped working sending me into a reboot loop. Calling skytech customer service told me just to return the pc to amazon and they cant do anything bc it was purchased through amazon so they wouldnt even really talk to me.. I ended up just doing a fresh install of windows 10 and upgrading to 32gigs of corsair vengeance pro ram and again am blown away by how well this machine runs (on my 1060 there was games I struggled to run on medium setting 1080p at 60fps I'm running the same games on max 1440p setting around 120 fps).. I cant recommend this as its labeled as plug and play and I spent my first 3 days redownloading installing updating and replacing parts and going by alot of the reviews I'm not the only one.. However if this purchase doesn't break the bank for you and you plan to do upgrades to this machine anyways then I think it's highly worth it as the rtx 3060ti is hard to find for less then 1000$ and is a great card."
  },
  {
    "id": "924e13b9-2d54-4b2f-a74d-a77b362d6ead",
    "name": "Alistair",
    "ratings": "⭐⭐⭐⭐⭐",
    "img": "https://media.istockphoto.com/photos/smiling-indian-business-man-working-on-laptop-at-home-office-young-picture-id1307615661?k=20&m=1307615661&s=612x612&w=0&h=JbfJwPz5MqC22zaKLS1WPomM28TU2jwVJM1G0o1eL4Q=",
    "review": "I did the research on what it would cost to get all the components separately and build it yourself...close to $1900. And that’s with close-to-MSRP graphics cards. The reality is that all 3000 series graphics cards are HARD to find, and the price is always inflated. So it was great to find one already in this PC. Plus, this computer came with a keyboard and mouse, which saves you about $50 there. High quality items, too. I ended up getting a different mouse with RGB but I like the skytech keyboard better (it has RGB). Overall I’m really happy that I got to save time and money by ordering a prebuilt PC."
  }
]
